In [1]:
import pandas as pd

In [2]:
path = "../data"

In [3]:
cdata = pd.read_csv( path + '/cdata_07.csv',sep=',', dtype='object')

In [4]:
cdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41705360 entries, 0 to 41705359
Data columns (total 11 columns):
 #   Column         Dtype
---  ------         -----
 0   Unnamed: 0     object
 1   emp_user_id    object
 2   emp_user_name  object
 3   dept_id        object
 4   dept_name      object
 5   user_ip        object
 6   req_type       object
 7   system_seq     object
 8   req_url        object
 9   req_end_time   object
 10  result_type    object
dtypes: object(11)
memory usage: 3.4+ GB

In [4]:
cdata.isnull().sum()

emp_user_id        404508
emp_user_name    15463976
dept_id          15565535
dept_name        16161006
user_ip                 0
req_type                0
system_seq              0
req_url                 0
req_end_time            0
result_type             0
dtype: int64

In [5]:
cdata.head()

,emp_user_id,emp_user_name,dept_id,dept_name,user_ip,req_type,system_seq,req_url,req_end_time,result_type
0,172.10.132.6,NaN,NaN,NaN,172.10.132.6,RD,2,http://erp.kistec.or.kr:80/com/mainForm.do,20220701101108,6
1,172.12.101.72,NaN,NaN,NaN,172.12.101.72,RD,2,http://erp.kistec.or.kr:80/com/mainForm.do,20220701090809,6
2,172.12.101.72,NaN,NaN,NaN,172.12.101.72,RD,2,http://erp.kistec.or.kr:80/com/mainForm.do,20220701090827,6
3,172.10.122.14,NaN,NaN,NaN,172.10.122.14,RD,2,http://erp.kistec.or.kr:80/com/mainForm.do,20220701091044,6
4,2018041340,고다상,61111139,교량실,172.10.122.14,RD,2,http://erp.kistec.or.kr:80/com/bottomFrame.do,20220701091051,"6,7"

In [6]:
cdata.req_url.unique()

array(['http://erp.kistec.or.kr:80/com/mainForm.do',
       'http://erp.kistec.or.kr:80/com/bottomFrame.do',
       'http://erp.kistec.or.kr:80/com/other.do?method=employeePop&empl_no=199903020',
       ...,
       'https://www.kalisedu.or.kr/user/enroll/EnrollUserPaymentPrepareUpdate.do?payMethodCd=001000000000&res_msg=성공&req_tx=pay&paymentEndDt=Fri Oct 21 18:00:00 KST 2022&trace_no=B6833ACAGH8UJ6KI&buyr_mail=ktg05218@naver.com&shop_user_id=3016920&tran_cd=00100000&enc_info=4my8daI0rICh2Q5XyaV6TSXhS89Lvc.X97dL3vzlvRMcwHxqE8avuRKQlVbtinuiNO2iJj9uoxNNorSTdDvN2gOkyvW-9dImd9StSk8hVScDrBEvPd5zznzZ23ySCq0tf9Dna9v3Dw13z1Na0smboe4a9BzjrdvDhOcIjnvnsysk8BGdKvY0f5foddSRLMy3j0.XB8k6Nhk__&_menu=206&endDay=9&buyr_name=김태근&currency',
       'https://www.kalisedu.or.kr/common/payment/PaymentCommonSave.do?payMethodCd=001000000000&res_msg=성공&req_tx=pay&paymentEndDt=Fri Oct 21 18:00:00 KST 2022&trace_no=B6833ACAGH8UJ6KI&buyr_mail=ktg05218@naver.com&shop_user_id=3016920&tran_cd=00100000&enc_info=4my8daI0rICh2Q5XyaV6TSXhS89Lvc.X97dL3vzlvRMcwHxqE8avuRKQlVbtinuiNO2iJj9uoxNNorSTdDvN2gOkyvW-9dImd9StSk8hVScDrBEvPd5zznzZ23ySCq0tf9Dna9v3Dw13z1Na0smboe4a9BzjrdvDhOcIjnvnsysk8BGdKvY0f5foddSRLMy3j0.XB8k6Nhk__&_menu=206&paymentId=202210121042567711495&endDay=9&',
       'https://www.kalisedu.or.kr/user/enroll/EnrollUserPaymentView.do?_menu=206&enrollNo=1333133&searchCompNm=행정안전부 정부청사관리본부'],
      dtype=object)

> ##### Add date, time column #####

In [7]:
cdata['datetime'] = pd.to_datetime( cdata['req_end_time'], format='%Y%m%d%H%M%S')

In [8]:
cdata.datetime.head()

0   2022-07-01 10:11:08
1   2022-07-01 09:08:09
2   2022-07-01 09:08:27
3   2022-07-01 09:10:44
4   2022-07-01 09:10:51
Name: datetime, dtype: datetime64[ns]

> ##### Add days columns #####

In [9]:
from datetime import datetime

In [10]:
days = [ 'mon', 'tue', 'wed', 'thi', 'fri', 'sat', 'sun' ]

cdata['days'] =  cdata.datetime.apply( pd.to_datetime ).map( datetime.weekday ).map( lambda x: days[x] )

In [15]:
# cdata.drop( columns=['req_end_time', ], inplace=True )

In [12]:
cdata_v2 = cdata[
        ['emp_user_id', 'emp_user_name', 'dept_id', 'dept_name', 'user_ip', 'req_type', 'system_seq', 'result_type', 'datetime', 'days']
    ]

In [11]:
# d = cdata_v2.values

In [13]:
cdata_v2.columns

Index(['emp_user_id', 'emp_user_name', 'dept_id', 'dept_name', 'user_ip',
       'req_type', 'system_seq', 'result_type', 'datetime', 'days'],
      dtype='object')

In [14]:
cdata_v2.head()

,emp_user_id,emp_user_name,dept_id,dept_name,user_ip,req_type,system_seq,result_type,datetime,days
0,172.10.132.6,NaN,NaN,NaN,172.10.132.6,RD,2,6,2022-07-01 10:11:08,fri
1,172.12.101.72,NaN,NaN,NaN,172.12.101.72,RD,2,6,2022-07-01 09:08:09,fri
2,172.12.101.72,NaN,NaN,NaN,172.12.101.72,RD,2,6,2022-07-01 09:08:27,fri
3,172.10.122.14,NaN,NaN,NaN,172.10.122.14,RD,2,6,2022-07-01 09:10:44,fri
4,2018041340,고다상,61111139,교량실,172.10.122.14,RD,2,"6,7",2022-07-01 09:10:51,fri

In [15]:
cdata_v2['time'] = cdata_v2.datetime.apply( pd.Timestamp ).dt.time.astype('string')

C:\Users\user\AppData\Local\Temp\ipykernel_18392\3025207583.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cdata_v2['time'] = cdata_v2.datetime.apply( pd.Timestamp ).dt.time.astype('string')

In [16]:
cdata_v2.head()

,emp_user_id,emp_user_name,dept_id,dept_name,user_ip,req_type,system_seq,result_type,datetime,days,time
0,172.10.132.6,NaN,NaN,NaN,172.10.132.6,RD,2,6,2022-07-01 10:11:08,fri,10:11:08
1,172.12.101.72,NaN,NaN,NaN,172.12.101.72,RD,2,6,2022-07-01 09:08:09,fri,09:08:09
2,172.12.101.72,NaN,NaN,NaN,172.12.101.72,RD,2,6,2022-07-01 09:08:27,fri,09:08:27
3,172.10.122.14,NaN,NaN,NaN,172.10.122.14,RD,2,6,2022-07-01 09:10:44,fri,09:10:44
4,2018041340,고다상,61111139,교량실,172.10.122.14,RD,2,"6,7",2022-07-01 09:10:51,fri,09:10:51

In [17]:
cdata_v2['req_type'].unique()

array(['RD', 'CR', 'UD', 'DL', 'DN', 'PR'], dtype=object)

In [18]:
cdata_v2['system_seq'].unique()

array(['2', '4', '5', '8', '9', '10', '12', '13', '14', '15', '3', '7'],
      dtype=object)

In [19]:
cdata_v2.groupby('req_type').sum()

In [ ]:
cdata_v2.groupby('system_seq').sum()